In [1]:
"""
@Author: Mohammad Fatha
@Date: 2021-11-24
@Last Modified by: Mohammad Fatha
@Title : To create a dataframe from titanic.csv and perform sql operations on it.
"""
import findspark

In [2]:
findspark.init('/home/fatha/Downloads/spark-3.1.2-bin-hadoop3.2')

In [3]:
from pyspark.sql import *
spark = SparkSession.builder.getOrCreate()
from pyspark.sql.functions import *

2021-11-24 09:31:56,092 WARN util.NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).

In [5]:
df= spark.read.option("inferSchema", "true").csv("hdfs://localhost:9000/Spark/titanic.csv", header=True)

In [6]:
df.show()

+--------+------+------+----+-----+-----+-------+--------+------+-----+----------+----+-----------+-----+-----+
|survived|pclass|   sex| age|sibsp|parch|   fare|embarked| class|  who|adult_male|deck|embark_town|alive|alone|
+--------+------+------+----+-----+-----+-------+--------+------+-----+----------+----+-----------+-----+-----+
|       0|     3|  male|22.0|    1|    0|   7.25|       S| Third|  man|      true|null|Southampton|   no|false|
|       1|     1|female|38.0|    1|    0|71.2833|       C| First|woman|     false|   C|  Cherbourg|  yes|false|
|       1|     3|female|26.0|    0|    0|  7.925|       S| Third|woman|     false|null|Southampton|  yes| true|
|       1|     1|female|35.0|    1|    0|   53.1|       S| First|woman|     false|   C|Southampton|  yes|false|
|       0|     3|  male|35.0|    0|    0|   8.05|       S| Third|  man|      true|null|Southampton|   no| true|
|       0|     3|  male|null|    0|    0| 8.4583|       Q| Third|  man|      true|null| Queenstown|   no| true|
|       0|     1|  male|54.0|    0|    0|51.8625|       S| First|  man|      true|   E|Southampton|   no| true|
|       0|     3|  male| 2.0|    3|    1| 21.075|       S| Third|child|     false|null|Southampton|   no|false|
|       1|     3|female|27.0|    0|    2|11.1333|       S| Third|woman|     false|null|Southampton|  yes|false|
|       1|     2|female|14.0|    1|    0|30.0708|       C|Second|child|     false|null|  Cherbourg|  yes|false|
|       1|     3|female| 4.0|    1|    1|   16.7|       S| Third|child|     false|   G|Southampton|  yes|false|
|       1|     1|female|58.0|    0|    0|  26.55|       S| First|woman|     false|   C|Southampton|  yes| true|
|       0|     3|  male|20.0|    0|    0|   8.05|       S| Third|  man|      true|null|Southampton|   no| true|
|       0|     3|  male|39.0|    1|    5| 31.275|       S| Third|  man|      true|null|Southampton|   no|false|
|       0|     3|female|14.0|    0|    0| 7.8542|       S| Third|child|     false|null|Southampton|   no| true|
|       1|     2|female|55.0|    0|    0|   16.0|       S|Second|woman|     false|null|Southampton|  yes| true|
|       0|     3|  male| 2.0|    4|    1| 29.125|       Q| Third|child|     false|null| Queenstown|   no|false|
|       1|     2|  male|null|    0|    0|   13.0|       S|Second|  man|      true|null|Southampton|  yes| true|
|       0|     3|female|31.0|    1|    0|   18.0|       S| Third|woman|     false|null|Southampton|   no|false|
|       1|     3|female|null|    0|    0|  7.225|       C| Third|woman|     false|null|  Cherbourg|  yes| true|
+--------+------+------+----+-----+-----+-------+--------+------+-----+----------+----+-----------+-----+-----+
only showing top 20 rows

In [7]:
df1=df.select("survived","pclass", "embark_town", "age","who")

In [8]:
df1.createOrReplaceTempView("titanic")

In [9]:
df1.show()

+--------+------+-----------+----+-----+
|survived|pclass|embark_town| age|  who|
+--------+------+-----------+----+-----+
|       0|     3|Southampton|22.0|  man|
|       1|     1|  Cherbourg|38.0|woman|
|       1|     3|Southampton|26.0|woman|
|       1|     1|Southampton|35.0|woman|
|       0|     3|Southampton|35.0|  man|
|       0|     3| Queenstown|null|  man|
|       0|     1|Southampton|54.0|  man|
|       0|     3|Southampton| 2.0|child|
|       1|     3|Southampton|27.0|woman|
|       1|     2|  Cherbourg|14.0|child|
|       1|     3|Southampton| 4.0|child|
|       1|     1|Southampton|58.0|woman|
|       0|     3|Southampton|20.0|  man|
|       0|     3|Southampton|39.0|  man|
|       0|     3|Southampton|14.0|child|
|       1|     2|Southampton|55.0|woman|
|       0|     3| Queenstown| 2.0|child|
|       1|     2|Southampton|null|  man|
|       0|     3|Southampton|31.0|woman|
|       1|     3|  Cherbourg|null|woman|
+--------+------+-----------+----+-----+
only showing top 20 rows

In [10]:
data=spark.sql("SELECT*FROM titanic")

In [11]:
data.show()

+--------+------+-----------+----+-----+
|survived|pclass|embark_town| age|  who|
+--------+------+-----------+----+-----+
|       0|     3|Southampton|22.0|  man|
|       1|     1|  Cherbourg|38.0|woman|
|       1|     3|Southampton|26.0|woman|
|       1|     1|Southampton|35.0|woman|
|       0|     3|Southampton|35.0|  man|
|       0|     3| Queenstown|null|  man|
|       0|     1|Southampton|54.0|  man|
|       0|     3|Southampton| 2.0|child|
|       1|     3|Southampton|27.0|woman|
|       1|     2|  Cherbourg|14.0|child|
|       1|     3|Southampton| 4.0|child|
|       1|     1|Southampton|58.0|woman|
|       0|     3|Southampton|20.0|  man|
|       0|     3|Southampton|39.0|  man|
|       0|     3|Southampton|14.0|child|
|       1|     2|Southampton|55.0|woman|
|       0|     3| Queenstown| 2.0|child|
|       1|     2|Southampton|null|  man|
|       0|     3|Southampton|31.0|woman|
|       1|     3|  Cherbourg|null|woman|
+--------+------+-----------+----+-----+
only showing top 20 rows

In [12]:
spark.sql("SELECT survived,embark_town FROM titanic").show()

+--------+-----------+
|survived|embark_town|
+--------+-----------+
|       0|Southampton|
|       1|  Cherbourg|
|       1|Southampton|
|       1|Southampton|
|       0|Southampton|
|       0| Queenstown|
|       0|Southampton|
|       0|Southampton|
|       1|Southampton|
|       1|  Cherbourg|
|       1|Southampton|
|       1|Southampton|
|       0|Southampton|
|       0|Southampton|
|       0|Southampton|
|       1|Southampton|
|       0| Queenstown|
|       1|Southampton|
|       0|Southampton|
|       1|  Cherbourg|
+--------+-----------+
only showing top 20 rows

In [13]:
spark.sql("SELECT * FROM titanic WHERE `survived`=1").show()

+--------+------+-----------+----+-----+
|survived|pclass|embark_town| age|  who|
+--------+------+-----------+----+-----+
|       1|     1|  Cherbourg|38.0|woman|
|       1|     3|Southampton|26.0|woman|
|       1|     1|Southampton|35.0|woman|
|       1|     3|Southampton|27.0|woman|
|       1|     2|  Cherbourg|14.0|child|
|       1|     3|Southampton| 4.0|child|
|       1|     1|Southampton|58.0|woman|
|       1|     2|Southampton|55.0|woman|
|       1|     2|Southampton|null|  man|
|       1|     3|  Cherbourg|null|woman|
|       1|     2|Southampton|34.0|  man|
|       1|     3| Queenstown|15.0|child|
|       1|     1|Southampton|28.0|  man|
|       1|     3|Southampton|38.0|woman|
|       1|     3| Queenstown|null|woman|
|       1|     1|  Cherbourg|null|woman|
|       1|     3| Queenstown|null|woman|
|       1|     3|  Cherbourg|null|  man|
|       1|     3|  Cherbourg|14.0|child|
|       1|     2|  Cherbourg| 3.0|child|
+--------+------+-----------+----+-----+
only showing top 20 rows

In [14]:
spark.sql("SELECT * FROM titanic WHERE `age`>=0 ORDER BY age desc limit 10").show()

+--------+------+-----------+----+---+
|survived|pclass|embark_town| age|who|
+--------+------+-----------+----+---+
|       1|     1|Southampton|80.0|man|
|       0|     3|Southampton|74.0|man|
|       0|     1|  Cherbourg|71.0|man|
|       0|     1|  Cherbourg|71.0|man|
|       0|     3| Queenstown|70.5|man|
|       0|     2|Southampton|70.0|man|
|       0|     1|Southampton|70.0|man|
|       0|     2|Southampton|66.0|man|
|       0|     3| Queenstown|65.0|man|
|       0|     1|Southampton|65.0|man|
+--------+------+-----------+----+---+

In [16]:
spark.sql("SELECT COUNT('survived') FROM titanic").show()

+---------------+
|count(survived)|
+---------------+
|            891|
+---------------+

In [17]:
spark.sql("SELECT MAX(age) FROM titanic").show()

+--------+
|max(age)|
+--------+
|    80.0|
+--------+

In [18]:
spark.sql("SELECT MIN(age) FROM titanic").show()

+--------+
|min(age)|
+--------+
|    0.42|
+--------+

In [19]:
spark.sql("SELECT * FROM titanic WHERE `age`>60 ORDER BY age").show()

+--------+------+-----------+----+-----+
|survived|pclass|embark_town| age|  who|
+--------+------+-----------+----+-----+
|       0|     1|Southampton|61.0|  man|
|       0|     3|Southampton|61.0|  man|
|       0|     1|Southampton|61.0|  man|
|       1|     2|Southampton|62.0|  man|
|       1|     1|       null|62.0|woman|
|       0|     1|Southampton|62.0|  man|
|       0|     1|Southampton|62.0|  man|
|       1|     3|Southampton|63.0|woman|
|       1|     1|Southampton|63.0|woman|
|       0|     1|Southampton|64.0|  man|
|       0|     1|Southampton|64.0|  man|
|       0|     1|  Cherbourg|65.0|  man|
|       0|     3| Queenstown|65.0|  man|
|       0|     1|Southampton|65.0|  man|
|       0|     2|Southampton|66.0|  man|
|       0|     2|Southampton|70.0|  man|
|       0|     1|Southampton|70.0|  man|
|       0|     3| Queenstown|70.5|  man|
|       0|     1|  Cherbourg|71.0|  man|
|       0|     1|  Cherbourg|71.0|  man|
+--------+------+-----------+----+-----+
only showing top 20 rows

In [24]:
spark.sql("SELECT COUNT('survived') FROM  titanic WHERE `age`>60").show()

+---------------+
|count(survived)|
+---------------+
|             22|
+---------------+

In [25]:
spark.sql("SELECT who FROM titanic WHERE age = (SELECT MAX(age) FROM titanic)").show()

+---+
|who|
+---+
|man|
+---+

In [33]:
spark.sql("SELECT * FROM titanic WHERE age=60").show()

+--------+------+-----------+----+-----+
|survived|pclass|embark_town| age|  who|
+--------+------+-----------+----+-----+
|       1|     1|  Cherbourg|60.0|woman|
|       1|     1|  Cherbourg|60.0|  man|
|       0|     2|Southampton|60.0|  man|
|       0|     1|Southampton|60.0|  man|
+--------+------+-----------+----+-----+

In [34]:
spark.sql("SELECT MAX(age) AS `Maximum age` FROM titanic").show()

+-----------+
|Maximum age|
+-----------+
|       80.0|
+-----------+